
set names utf8;
use starbucks;

create table xbk_code(
	lid int primary key auto_increment,
	imgs varchar(126),
	p1 varchar(32),
	h1 varchar(32),
	p2 varchar(126),
	p3 varchar(32),
	p4 varchar(32),
	p5 varchar(32),
	tr1d2 varchar(126),
	tr2d2 varchar(126),
	tr3d2 varchar(126),
	tr4d2 varchar(126),
	tr5d2 varchar(126)
);

INSERT INTO xbk_code  VALUES(1,'./img/coffee product/coffee bean/01.jpg','中度烘焙','星巴克®凤舞祥云综合咖啡豆','这款亚洲/太平洋综合咖啡是自2009年来星巴克首款融入产自中国地区咖啡豆的综合咖啡。','烘焙程度：中度烘焙','酸度：低','醇度：中等','亚洲/太平洋','水洗法/半水洗法','温和清爽的酸度，中等醇度，均衡的风味带有草本和香料般风味','奶油芝士类食品，太妃、枫糖和坚果类食品','低因祥龙综合咖啡®，星巴克®苏门答腊咖啡');
INSERT INTO xbk_code VALUES(2,'./img/coffee product/coffee bean/02.png','中度烘焙','星巴克®肯亚咖啡豆','肯亚咖啡拥有多层次复杂的风味，包含果汁般的酸度、明显丰富的葡萄柚味和葡萄酒的醇香般风味，醇度中等。','烘焙程度：中度烘焙','酸度：高','醇度：厚重','非洲/阿拉伯','水洗法','葡萄柚味，浆果味，如果汁般，口感丰富','葡萄柚，浆果，无核葡萄干，葡萄干，橙子','星巴克®埃塞俄比亚');
INSERT INTO xbk_code  VALUES(3,'./img/coffee product/coffee bean/03.png','深度烘焙','星巴克®低因祥龙综合咖啡豆','具有浓郁的草药味、香料味和泥土芳香；这款浓郁而平和的亚洲/太平洋地区综合咖啡展现出厚重的醇度以及令人惊奇的酸度之间的良好平衡','烘焙程度：深度烘焙','酸度：低','醇度：厚重','亚洲/太平洋','水洗法，半水洗法','丰富的草本般的风味','肉桂，燕麦片，枫糖，黄油面包','星巴克®苏门答腊咖啡');
INSERT INTO xbk_code VALUES(4,'./img/coffee product/coffee bean/04.png','中度烘焙','星巴克®危地马拉安提瓜咖啡豆','这是一款典雅、丰富并具有深度的咖啡，其精致的酸度与微妙的可可粉质感以及柔和的香料风味完美地平衡在了一起。','烘焙程度：中度烘焙','酸度：中等','醇度：中等','拉丁美洲','水洗法，半水洗法','可可和淡淡的香料般风味','可可，苹果，焦糖，果仁','星巴克®首选综合咖啡');
INSERT INTO xbk_code  VALUES(5,'./img/coffee product/coffee bean/05.png','中度烘焙','星巴克®埃塞俄比亚咖啡豆','这款精心呈现的综合咖啡口感温和顺滑，带有花香和香料般风味，表达了我们对咖啡诞生地由衷的赞美。','烘焙程度：中度烘焙','酸度：中等','醇度：中等','	非洲','水洗法，半水洗法','可可和淡淡的香料般风味','黑巧克力、柑橘','星巴克®肯亚咖啡');
INSERT INTO xbk_code  VALUES(6,'./img/coffee product/coffee bean/06.png','中度烘焙','星巴克®派克市场烘焙咖啡豆','中等醇度并伴随着可可和烤果仁般的微妙风味，呈现出一杯令人愉悦而口感平衡的咖啡。','烘焙程度：中度烘焙','酸度：中等','醇度：中等','拉丁美洲','水洗法，半水洗法','烘烤果仁味，顺滑、平和','巧克力，肉桂，果仁','星巴克®首选综合咖啡、星巴克®佛罗娜咖啡、星巴克®危地马拉安提瓜咖啡');
INSERT INTO xbk_code VALUES(7,'./img/coffee product/coffee bean/07.png','深度烘焙','星巴克®佛罗娜咖啡豆','这是一款来自拉丁美洲咖啡和亚洲／太平洋地区咖啡的综合咖啡，醇度厚重，并带有意式烘焙咖啡的香甜味。','烘焙程度：中度烘焙','酸度：中等','醇度：中等','多区域','水洗法，半水洗法','烘烤果仁味，黑可可般风味','牛奶和黑巧克力、焦糖','星巴克®浓缩烘焙咖啡');
INSERT INTO xbk_code  VALUES(8,'./img/coffee product/coffee bean/08.jpg','深度烘焙','星巴克®意式烘焙咖啡豆','这是一款醇度浓郁的多区域综合咖啡，经过比浓缩烘焙咖啡更深度的烘焙，醇度适中，带有烘焙后的甜感。','烘焙程度：中度烘焙','酸度：中等','醇度：中等','多区域','水洗法，半水洗法','烘焙般的风味，香甜','巧克力，焦糖，香料','星巴克®浓缩烘焙咖啡');
INSERT INTO xbk_code  VALUES(9,'./img/coffee product/coffee bean/09.png','中度烘焙','星巴克®早餐综合咖啡豆','这款醇度清淡的综合咖啡活泼而清爽，唤醒你的味蕾，带给你明快的第一印象，让你焕然一新，开始新的一天。','烘焙程度：中度烘焙','酸度：中等','醇度：中等','拉丁美洲','水洗法，半水洗法','清爽、香气扑鼻','果仁，苹果，蓝莓，柠檬','	星巴克®轻柳咖啡');